DataProcessors/ЗаполнениеШтрихкодовВТабличнойЧасти.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеШтрихкодовВТабличнойЧасти</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СерииНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B1_ОсновнаяСерияВБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВесМеталла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Размер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварнаяПозиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеПозиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦветМеталла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветаМеталла</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВесМеталлаГИИСДМДК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Весовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбщийВесВставок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВесМеталлаВЧистоте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбщийВесВставокГИИСДМДК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВесМеталлаВЧистотеГИИСДМДК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВесоваяГруппаГИИСДМДК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторВесовыхГруппГИИСДМДК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтепеньВнутреннегоОтраженияГИИСДМДК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтепенейВнутреннегоОтраженияГИИСДМДК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаличиеСколовДефектовГИИСДМДК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторНаличияСколовДефектовГИИСДМДК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаОгранкиГИИСДМДК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторГруппОгранкиГИИСДМДК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяКлассификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительнаяКлассификацияГИИСДМДК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕстьФизическаяМаркировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НельзяНанестиФизическуюМаркировку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидПартийГИИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПартийГИИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УИН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗаполнениеШтрихкодовВТабличнойЧасти/Forms/ФормаОбработки/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	Для каждого СтрокаТовара Из ТабличноеПолеТовары Цикл
		СтрокаТовара.НовыйШтрихкод = ПолучитьАктуальныйШтрихшкод(СтрокаТовара.Номенклатура, СтрокаТовара.ХарактеристикаНоменклатуры, СтрокаТовара.Размер);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьАктуальныйШтрихшкод(НоменклатураИзДокумента, ХарактеристикаНоменклатурыИзДокумента, РазмерИзДокумента)
	
	ВозвращаемыйШтрихкод = "";
	
	Если ТипЗнч(ИсходныйДокумент) = Тип("ДокументСсылка.ПоступлениеПродукцииИзПроизводства")Тогда
		ДокументСтрока = "ПоступлениеПродукцииИзПроизводства";	
	Иначе
		ДокументСтрока = "ПоступлениеТоваровУслуг";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПоступлениеТоваровУслугТовары.Размер КАК Размер,
	|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры.Наименование КАК СННаименование,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата КАК Дата
	|ПОМЕСТИТЬ Таб1
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата <= &Дата
	|	И ПоступлениеТоваровУслугТовары.Ссылка <> &ССЫЛКА
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслугТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ПоступлениеТоваровУслугТовары.Номенклатура = &Номенклатура
	|	И ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|	И ПоступлениеТоваровУслугТовары.Размер = &Размер
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Размер,
	|	ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры,
	|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры.Наименование,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеПродукцииИзПроизводстваТовары.Номенклатура,
	|	ПоступлениеПродукцииИзПроизводстваТовары.ХарактеристикаНоменклатуры,
	|	ПоступлениеПродукцииИзПроизводстваТовары.Размер,
	|	ПоступлениеПродукцииИзПроизводстваТовары.СерияНоменклатуры.Наименование,
	|	ПоступлениеПродукцииИзПроизводстваТовары.Ссылка.Дата
	|ИЗ
	|	Документ.ПоступлениеПродукцииИзПроизводства.Товары КАК ПоступлениеПродукцииИзПроизводстваТовары
	|ГДЕ
	|	ПоступлениеПродукцииИзПроизводстваТовары.Ссылка.Дата <= &Дата
	|	И ПоступлениеПродукцииИзПроизводстваТовары.Ссылка <> &ССЫЛКА
	|	И ПоступлениеПродукцииИзПроизводстваТовары.Ссылка.Проведен = ИСТИНА
	|	И ПоступлениеПродукцииИзПроизводстваТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ПоступлениеПродукцииИзПроизводстваТовары.Номенклатура = &Номенклатура
	|	И ПоступлениеПродукцииИзПроизводстваТовары.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|	И ПоступлениеПродукцииИзПроизводстваТовары.Размер = &Размер
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеПродукцииИзПроизводстваТовары.Размер,
	|	ПоступлениеПродукцииИзПроизводстваТовары.ХарактеристикаНоменклатуры,
	|	ПоступлениеПродукцииИзПроизводстваТовары.СерияНоменклатуры.Наименование,
	|	ПоступлениеПродукцииИзПроизводстваТовары.Номенклатура,
	|	ПоступлениеПродукцииИзПроизводстваТовары.Ссылка.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Таб1.Номенклатура КАК Номенклатура,
	|	Таб1.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Таб1.Размер КАК Размер,
	|	Таб1.СННаименование КАК Наименование,
	|	Таб1.Дата КАК Дата
	|ИЗ
	|	Таб1 КАК Таб1
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", ИсходныйДокумент.Дата);
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	//"ВЫБРАТЬ
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СерииНоменклатуры.Наименование) КАК КоличествоНаименований
	//|ИЗ
	//|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	//|ГДЕ
	//|	СерииНоменклатуры.Владелец = &Номенклатура
	//|	И СерииНоменклатуры.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	//|	И СерииНоменклатуры.Размер = &Размер
	//|
	//|ИМЕЮЩИЕ
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СерииНоменклатуры.Наименование) = 1
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СУММА(1) КАК КоличествоШтрихкодов,
	//|	СерииНоменклатуры.Наименование КАК Наименование
	//|ИЗ
	//|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	//|ГДЕ
	//|	СерииНоменклатуры.Владелец = &Номенклатура
	//|	И СерииНоменклатуры.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	//|	И СерииНоменклатуры.Размер = &Размер
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	СерииНоменклатуры.Наименование
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(1) > 1";
	
	//РезультатЗапроса = Запрос.ВыполнитьПакет();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать();
	//
	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса[1].Выбрать();
	//	
	//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//		ВозвращаемыйШтрихкод = ВыборкаДетальныеЗаписи.Наименование;
	//	КонецЕсли;	 
	//	
	//КонецЕсли;
	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураИзДокумента);
	Запрос.УстановитьПараметр("ССЫЛКА", ИсходныйДокумент.Ссылка);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатурыИзДокумента);	
	Запрос.УстановитьПараметр("Размер", РазмерИзДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВозвращаемыйШтрихкод = ВыборкаДетальныеЗаписи.Наименование;
	КонецЦикла;
	
	Возврат ВозвращаемыйШтрихкод;

КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	
	Для каждого СтрокаТабличногоПоля Из ТабличноеПолеТовары Цикл
		Если ЗначениеЗаполнено(СтрокаТабличногоПоля.НовыйШтрихкод) Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Номенклатура", СтрокаТабличногоПоля.Номенклатура);
			ПараметрыОтбора.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличногоПоля.ХарактеристикаНоменклатуры);
			ПараметрыОтбора.Вставить("Размер", СтрокаТабличногоПоля.Размер);
			НайденныеСтроки = ТоварыТаблица.НайтиСтроки(ПараметрыОтбора); 

			Если НайденныеСтроки.Количество() Тогда
				
				ПоказатьСообщение = Ложь;
				Для каждого НайденнаяСторка Из НайденныеСтроки Цикл
					Если НайденнаяСторка.СерияНоменклатуры <> Справочники.СерииНоменклатуры.ПустаяСсылка()
						И НайденнаяСторка.СерияНоменклатуры.Наименование <> СтрокаТабличногоПоля.НовыйШтрихкод Тогда
						
						ПоказатьСообщение = Истина;
						СерияНоменклатурыОбъект = НайденнаяСторка.СерияНоменклатуры.ПолучитьОбъект();
						СерияНоменклатурыОбъект.Наименование = СтрокаТабличногоПоля.НовыйШтрихкод;
						
						Попытка
							СерияНоменклатурыОбъект.Записать();
						Исключение
							ПоказатьСообщение = Ложь;
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = "Ошибка при записи серии номенклатуры " + НайденнаяСторка.СерияНоменклатуры + ОписаниеОшибки();
							Сообщение.Сообщить();
						КонецПопытки;
					КонецЕсли;
				КонецЦикла;
				
				Если ПоказатьСообщение Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Установлен штрихкод " + СтрокаТабличногоПоля.НовыйШтрихкод + " для " + 
					СтрокаТабличногоПоля.Номенклатура + ", " +
					СтрокаТабличногоПоля.ХарактеристикаНоменклатуры + ", размер: " + СтрокаТабличногоПоля.Размер;
					Сообщение.Сообщить();
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Выполнение обработки завершено");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	ЗаписатьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивТоваров") Тогда
		
		МассивТоваров = Параметры.МассивТоваров;
		
		Для Каждого ЭлементМассива Из МассивТоваров Цикл
			ЗаполнитьЗначенияСвойств(ТоварыТаблица.Добавить(), ЭлементМассива); 
		КонецЦикла;
		
		СчетчикСтрок = 0;
		ТоварыСвернутыеТаблица = ТоварыТаблица.Выгрузить();
		ТоварыСвернутыеТаблица.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, Размер");
		Для каждого СтрокаТоварыСвернутые Из ТоварыСвернутыеТаблица Цикл
			НоваяСтрока = ТабличноеПолеТовары.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоварыСвернутые);
			НоваяСтрока.Артикул = СтрокаТоварыСвернутые.Номенклатура.Артикул;
			НоваяСтрока.Проба = СтрокаТоварыСвернутые.Номенклатура.Проба;
			СчетчикСтрок = СчетчикСтрок + 1;
			НоваяСтрока.НомерСтроки = СчетчикСтрок;
		КонецЦикла; 		
		
	КонецЕсли;
	
	Если Параметры.Свойство("ИсходныйДокумент") Тогда
		ИсходныйДокумент = Параметры.ИсходныйДокумент;
	КонецЕсли;

КонецПроцедуры
